# ProgressDlgSetBotMsg

## Description
Set bottom message of a progress dialog.

```pascal
PROCEDURE ProgressDlgSetBotMsg(message : STRING);
```

```python
def vs.ProgressDlgSetBotMsg(message):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|message|STRING|   |

## Examples
les can be found at [[VS:Progress Dialog]].

```pascal
ProgressDlgSetBotMsg('Example');
```
```python
import vs

# Set bottom message of a progress dialog.
message = 'Hello Vectorworks'

vs.ProgressDlgSetBotMsg(message)
```

## See Also
ProgressDlgOpen | ProgressDlgClose | ProgressDlgSetTopMsg | ProgressDlgSetBotMsg | ProgressDlgSetMeter | ProgressDlgStart | ProgressDlgEnd | ProgressDlgHasCancel | ProgressDlgYield

## Version
Availability: from Vectorworks 2015

## Category
* Utility